<template>
    <HeroSection
        :background="heroImage"
        title='<mark class="bg-yellow-200 text-black text-2xl font-bold">من نحن </mark><br /> برنامج الاغذية العالمي للأمم المتحدة '>
    </HeroSection>

    <div class="p-6 space-y-10">
        <IntroBlock :paragraphs="intro" />
        <div class="flex flex-col lg:flex-row gap-6">
        <SidebarNav :items="sectionsA" />
        <div class="w-full lg:w-3/4 space-y-6">
            <SectionBlock
            v-for="section in sectionsA"
            :key="section.id"
            :id="section.id"
            :title="section.title"
            :paragraphs="section.paragraphs"
            />
        </div>
        </div>
    </div>
</template>

<script setup>
    import HeroSection from '../components/HeroSection.vue'
    import heroImage from '../assets/images/image4.png'
    import IntroBlock from '@/components/IntroBlock.vue'
    import SectionBlock from '@/components/SectionBlock.vue'
    import SidebarNav from '@/components/SidebarNav.vue'

    const intro = [
    'برنامج الأغذية العالمي يعمل في أكثر من 120 دولة لدعم المجتمعات المحتاجة وتقديم المساعدات الإنسانية، مع التركيز على بناء القدرة على الصمود.',
    'نحن نساعد الحكومات على التخفيف من آثار الكوارث والصدمات المناخية، ونعزز سبل العيش المستدامة لضمان الأمن الغذائي للجميع.'
    ]

    const sectionsA = [
    {
        id: "section1",
        title: "الجوع لا ينبغي أن يكون مشكلة في عالمنا اليوم",
        paragraphs: [
        "في عالم يتوفر فيه غذاء يكفي لإطعام كل سكان الكوكب، ينبغي أن يكون الجوع شيئاً من الماضي. ومع ذلك، فإن النزاعات، وتغير المناخ، والنزوح، والصدمات الاقتصادية، وعدم المساواة تجعل 319 مليون شخص يعانون من الجوع الحاد، وتلوح في الأفق مجاعة تهدد 1.9 مليون شخص. ففي مخيم زمزم في شمالي السودان، تم تأكيد حدوث المجاعة بالفعل.",
        "بفضل الشغف والتفاني والكفاءة لموظفينا البالغ عددهم 21,700 حول العالم، يعمل البرنامج في أكثر من 120 دولة ومنطقة لتقديم الطعام المنقذ لحياة الأشخاص الذين نزحوا بسبب النزاعات وللمحتاجين الذين تضرروا بفعل الكوارث، ويساعد الأفراد والمجتمعات في إيجاد حلول جذرية للتحديات المتعددة التي يواجهونها في سبيل بناء مستقبل أفضل.",
        "نحن نعمل على تحسين التغذية لدى النساء والأطفال، ودعم المزارعين أصحاب الحيازات الصغيرة من أجل تحسين إنتاجيتهم وتقليل خسائرهم، ومساعدة البلدان والمجتمعات على الاستعداد للصدمات المناخية والتعامل معها، وتعزيز رأس المال البشري من خلال برامج التغذية المدرسية.",
        "وفي حالات النزاع، نقدم الإغاثة للسكان المستنزفين ونستخدم المساعدة الغذائية لبناء مسارات للسلام والاستقرار - وهو العمل الذي حصل بموجبه البرنامج على جائزة نوبل للسلام عام 2020."
        ]
    },
    {
        id: "section2",
        title: "نحن ننقذ الأرواح",
        paragraphs: [
        "بالنسبة لملايين البشر في مختلف أنحاء العالم، فإن الإغاثة الطارئة التي يقدمها برنامج الأغذية العالمي أثناء الأزمات تشكل الفارق بين الحياة والموت.",
        "في أي يوم من الأيام، تجد لبرنامج الأغذية العالمي 5000 شاحنة و20 سفينة ونحو 80 طائرة تقوم بتقديم المساعدات الطارئة والإغاثة وإعادة التأهيل ومساعدات تنموية وعمليات خاصة للأشخاص المتضررين من النزاعات والجفاف والفيضانات والزلازل والأعاصير وفشل المحاصيل وغيرها من الكوارث. يجري ثلثا عملنا في البلدان المتضررة من النزاعات، حيث يكون الناس أكثر عرضة بثلاث مرات لنقص التغذية من أولئك الذين يعيشون في بلدان لا تعاني من النزاعات.",
        "عندما تهدأ حالة الطوارئ، يساعد برنامج الأغذية العالمي في إعادة بناء الحياة وسبل العيش من خلال تعزيز قدرة الناس والمجتمعات على الصمود."
        ]
    },
    {
        id: "section3",
        title: "نحن نغير الحياة",
        paragraphs: [
        "إن عملنا على بناء القدرة على الصمود والتكيف مع تغير المناخ وتعزيز التغذية الجيدة وتحسين أنظمة الغذاء يضع الأساس لمستقبل أكثر ازدهارًا لملايين الأشخاص.",
        "برنامج الأغذية العالمي هو أكبر منظمة إنسانية تنفذ برامج الوجبات المدرسية في جميع أنحاء العالم، حيث يملك أكثر من 50 عامًا من الخبرة في هذا المجال. في عام 2024، قام برنامج الأغذية العالمي بتوصيل نحو 2.5 طن متري من الغذاء وأنفق نحو 2.82 مليار دولار أمريكي على التحويلات النقدية وقسائم شراء السلع - مما عزز الأمن الغذائي والتغذوي واستدامة الاقتصادات المحلية في جميع أنحاء العالم."
        ]
    },
    {
        id: "section4",
        title: "نحن نعتمد على التبرعات الطوعية",
        paragraphs: [
        "إن توفير الغذاء لملايين من أشد الناس جوعًا في العالم ومساعدة الملايين على التعامل مع آثار الصراع وتغير المناخ والفقر المدقع يتطلب مليارات الدولارات كل عام.",
        "يتم تمويل عملياتنا بالكامل من خلال المساهمات الطوعية السخية من الحكومات والمؤسسات والشركات والأفراد المانحة. يذهب ما مجموعه 93.5 في المائة من جميع مساهمات الحكومات مباشرة لدعم العمليات التي تنقذ وتغير حياة الناس."
        ]
    },
    {
        id: "section5",
        title: "نعمل من خلال شراكات",
        paragraphs: [
        "يعمل برنامج الأغذية العالمي مع الحكومات ووكالات الأمم المتحدة الأخرى والمنظمات غير الحكومية والشركات الخاصة وغيرها من الجهات لتعبئة الموارد وإيجاد حلول مبتكرة والوصول إلى المجتمعات الضعيفة بالمساعدة التي تحتاج إليها."
        ]
    },
    {
        id: "section6",
        title: "نحن ملتزمون بالمساءلة والشفافية",
        paragraphs: [
        "يلتزم برنامج الأغذية العالمي وموظفيه بأعلى معايير النزاهة والسلوك. ونحن ملتزمون بالشفافية الكاملة والمساءلة أمام الأشخاص الذين نخدمهم والجهات المانحة التي تمول عملياتنا بسخاء.",
        "نقوم بإجراء عمليات تدقيق موضوعية ومستقلة، فضلاً عن التحقيقات والتفتيشات في المخالفات المشتبه بها وسوء السلوك والاحتيال، فضلاً عن الاستغلال الجنسي أو الاعتداء.",
        "لضمان بقائنا على قدر عال من الكفاءة والأهمية والتأثير والاستدامة لعملنا، نجري تقييمات مستقلة دورية. وتوفر هذه التقييمات للجهات المانحة والشركاء مزيدًا من التفاصيل حول فعالية وكفاءة وأهمية وتأثير واستدامة عملنا."
        ]
    }
    ]

</script>